app/controllers/api/v1/restaurants_controller.rb

      def index
        restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"